In [3]:
import numpy as np
import pandas as pd

In [5]:
np.random.seed(101)
mydata = np.random.randint(0, 101, (4,3))

In [6]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [7]:
myindex = ['CA', 'NY', 'AZ', 'TX']

In [8]:
mycolumns = ['Jan', 'Feb', 'Mar']

In [9]:
df = pd.DataFrame(mydata)

In [10]:
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [11]:
df = pd.DataFrame(data=mydata, index=myindex)

In [12]:
df

     0   1   2
CA  95  11  81
NY  70  63  87
AZ  75   9  77
TX  40   4  63

In [13]:
df = pd.DataFrame(data=mydata, index=myindex, columns=mycolumns)

In [14]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [16]:
pwd

'C:\\Users\\HP'

In [17]:
ls

 Volume in drive C is Windows
 Volume Serial Number is AC7E-C806

 Directory of C:\Users\HP

03-09-2023  12:12    <DIR>          .
21-07-2023  00:17    <DIR>          ..
09-07-2023  23:06    <DIR>          .android
17-04-2023  21:12               470 .bash_history
03-09-2023  12:13    <DIR>          .conda
03-09-2023  10:20                25 .condarc
12-04-2023  09:32    <DIR>          .config
01-09-2023  00:26    <DIR>          .continuum
17-04-2023  20:45                53 .gitconfig
09-07-2023  22:55    <DIR>          .gradle
03-09-2023  11:49    <DIR>          .ipynb_checkpoints
01-09-2023  00:41    <DIR>          .ipython
01-09-2023  01:04    <DIR>          .jupyter
09-07-2023  22:58    <DIR>          .m2
05-03-2023  22:35    <DIR>          .ms-ad
06-08-2023  19:59                74 .node_repl_history
06-08-2023  19:42    <DIR>          .rest-client
17-04-2023  21:10    <DIR>          .ssh
17-06-2023  11:16    <DIR>          .vscode
01-09-2023  00:27    <DIR>          anaconda3
09-07-2023  22:52    <DIR>          AndroidStudioProjects
23-08-2023  22:30    <DIR>          app
17-06-2023  11:19    <DIR>          clone_website
03-09-2023  12:12             9,003 dataframes.ipynb
17-06-2023  11:22    <DIR>          DeliveryRouteFinder
01-09-2023  00:13    <DIR>          Downloads
05-04-2023  22:21    <DIR>          DS-Project
17-06-2023  11:17    <DIR>          DS-Project-1
04-04-2023  22:59    <DIR>          DSW_Project
14-05-2023  13:08    <DIR>          Favorites
26-07-2023  19:56    <DIR>          Hackathon_Project
07-04-2023  23:59    <DIR>          Mobikart-Mobile-E-Commerce-Website
07-04-2023  23:52    <DIR>          mobile-shop-backend
06-03-2023  10:25    <DIR>          Music
02-09-2023  12:53            35,074 numpy.ipynb
03-09-2023  08:32    <DIR>          OneDrive
08-04-2023  00:02    <DIR>          Online-Mobile-Shopping-
08-04-2023  00:05    <DIR>          online-shopping
03-09-2023  11:00             9,272 pandas series.ipynb
04-04-2023  22:54    <DIR>          portfolio
09-04-2023  10:58    <DIR>          Postman
11-03-2023  16:02    <DIR>          Saved Games
08-04-2023  11:03    <DIR>          Searches
01-09-2023  00:46             1,023 Untitled.ipynb
01-09-2023  01:06             1,341 Untitled1.ipynb
01-09-2023  01:30             1,077 Untitled2.ipynb
01-09-2023  01:35             1,077 Untitled3.ipynb
02-09-2023  10:51             3,160 Untitled4.ipynb
03-09-2023  10:26                72 Untitled5.ipynb
03-09-2023  11:48                72 Untitled6.ipynb
10-03-2023  16:48    <DIR>          Videos
              14 File(s)         61,793 bytes
              37 Dir(s)  25,173,647,360 bytes free

In [18]:
ls

 Volume in drive C is Windows
 Volume Serial Number is AC7E-C806

 Directory of C:\Users\HP

03-09-2023  12:16    <DIR>          .
21-07-2023  00:17    <DIR>          ..
09-07-2023  23:06    <DIR>          .android
17-04-2023  21:12               470 .bash_history
03-09-2023  12:16    <DIR>          .conda
03-09-2023  10:20                25 .condarc
12-04-2023  09:32    <DIR>          .config
01-09-2023  00:26    <DIR>          .continuum
17-04-2023  20:45                53 .gitconfig
09-07-2023  22:55    <DIR>          .gradle
03-09-2023  11:49    <DIR>          .ipynb_checkpoints
01-09-2023  00:41    <DIR>          .ipython
01-09-2023  01:04    <DIR>          .jupyter
09-07-2023  22:58    <DIR>          .m2
05-03-2023  22:35    <DIR>          .ms-ad
06-08-2023  19:59                74 .node_repl_history
06-08-2023  19:42    <DIR>          .rest-client
17-04-2023  21:10    <DIR>          .ssh
17-06-2023  11:16    <DIR>          .vscode
01-09-2023  00:27    <DIR>          anaconda3
09-07-2023  22:52    <DIR>          AndroidStudioProjects
23-08-2023  22:30    <DIR>          app
17-06-2023  11:19    <DIR>          clone_website
03-09-2023  12:14            12,540 dataframes.ipynb
17-06-2023  11:22    <DIR>          DeliveryRouteFinder
01-09-2023  00:13    <DIR>          Downloads
05-04-2023  22:21    <DIR>          DS-Project
17-06-2023  11:17    <DIR>          DS-Project-1
04-04-2023  22:59    <DIR>          DSW_Project
14-05-2023  13:08    <DIR>          Favorites
26-07-2023  19:56    <DIR>          Hackathon_Project
07-04-2023  23:59    <DIR>          Mobikart-Mobile-E-Commerce-Website
07-04-2023  23:52    <DIR>          mobile-shop-backend
06-03-2023  10:25    <DIR>          Music
02-09-2023  12:53            35,074 numpy.ipynb
03-09-2023  08:32    <DIR>          OneDrive
08-04-2023  00:02    <DIR>          Online-Mobile-Shopping-
08-04-2023  00:05    <DIR>          online-shopping
03-09-2023  11:00             9,272 pandas series.ipynb
04-04-2023  22:54    <DIR>          portfolio
09-04-2023  10:58    <DIR>          Postman
11-03-2023  16:02    <DIR>          Saved Games
08-04-2023  11:03    <DIR>          Searches
03-09-2023  12:16                 0 tips.csv.txt
01-09-2023  00:46             1,023 Untitled.ipynb
01-09-2023  01:06             1,341 Untitled1.ipynb
01-09-2023  01:30             1,077 Untitled2.ipynb
01-09-2023  01:35             1,077 Untitled3.ipynb
02-09-2023  10:51             3,160 Untitled4.ipynb
03-09-2023  10:26                72 Untitled5.ipynb
03-09-2023  11:48                72 Untitled6.ipynb
10-03-2023  16:48    <DIR>          Videos
              15 File(s)         65,330 bytes
              37 Dir(s)  25,090,269,184 bytes free

In [19]:
ls

 Volume in drive C is Windows
 Volume Serial Number is AC7E-C806

 Directory of C:\Users\HP

03-09-2023  12:21    <DIR>          .
21-07-2023  00:17    <DIR>          ..
09-07-2023  23:06    <DIR>          .android
17-04-2023  21:12               470 .bash_history
03-09-2023  12:21    <DIR>          .conda
03-09-2023  10:20                25 .condarc
12-04-2023  09:32    <DIR>          .config
01-09-2023  00:26    <DIR>          .continuum
17-04-2023  20:45                53 .gitconfig
09-07-2023  22:55    <DIR>          .gradle
03-09-2023  11:49    <DIR>          .ipynb_checkpoints
01-09-2023  00:41    <DIR>          .ipython
01-09-2023  01:04    <DIR>          .jupyter
09-07-2023  22:58    <DIR>          .m2
05-03-2023  22:35    <DIR>          .ms-ad
06-08-2023  19:59                74 .node_repl_history
06-08-2023  19:42    <DIR>          .rest-client
17-04-2023  21:10    <DIR>          .ssh
17-06-2023  11:16    <DIR>          .vscode
01-09-2023  00:27    <DIR>          anaconda3
09-07-2023  22:52    <DIR>          AndroidStudioProjects
23-08-2023  22:30    <DIR>          app
17-06-2023  11:19    <DIR>          clone_website
03-09-2023  12:19            16,137 dataframes.ipynb
17-06-2023  11:22    <DIR>          DeliveryRouteFinder
01-09-2023  00:13    <DIR>          Downloads
05-04-2023  22:21    <DIR>          DS-Project
17-06-2023  11:17    <DIR>          DS-Project-1
04-04-2023  22:59    <DIR>          DSW_Project
14-05-2023  13:08    <DIR>          Favorites
26-07-2023  19:56    <DIR>          Hackathon_Project
07-04-2023  23:59    <DIR>          Mobikart-Mobile-E-Commerce-Website
07-04-2023  23:52    <DIR>          mobile-shop-backend
06-03-2023  10:25    <DIR>          Music
02-09-2023  12:53            35,074 numpy.ipynb
03-09-2023  08:32    <DIR>          OneDrive
08-04-2023  00:02    <DIR>          Online-Mobile-Shopping-
08-04-2023  00:05    <DIR>          online-shopping
03-09-2023  11:00             9,272 pandas series.ipynb
04-04-2023  22:54    <DIR>          portfolio
09-04-2023  10:58    <DIR>          Postman
11-03-2023  16:02    <DIR>          Saved Games
08-04-2023  11:03    <DIR>          Searches
03-09-2023  12:21                80 tips.csv
03-09-2023  12:16                 0 tips.csv.txt
01-09-2023  00:46             1,023 Untitled.ipynb
01-09-2023  01:06             1,341 Untitled1.ipynb
01-09-2023  01:30             1,077 Untitled2.ipynb
01-09-2023  01:35             1,077 Untitled3.ipynb
02-09-2023  10:51             3,160 Untitled4.ipynb
03-09-2023  10:26                72 Untitled5.ipynb
03-09-2023  11:48                72 Untitled6.ipynb
10-03-2023  16:48    <DIR>          Videos
              16 File(s)         69,007 bytes
              37 Dir(s)  25,352,785,920 bytes free

In [42]:
df = pd.read_csv('tips.csv')

In [43]:
df

      Name  RollNo  Subject  Fees  Extra_fees
0     Diya    3039    Maths  1200          29
1    Navya    3147  English   496          75
2  Geetika    3045  Science  3871           5

In [44]:
df.columns

Index(['Name', 'RollNo', 'Subject', 'Fees', 'Extra_fees'], dtype='object')

In [45]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [46]:
df.head(2)

    Name  RollNo  Subject  Fees  Extra_fees
0   Diya    3039    Maths  1200          29
1  Navya    3147  English   496          75

In [47]:
df.tail(2)

      Name  RollNo  Subject  Fees  Extra_fees
1    Navya    3147  English   496          75
2  Geetika    3045  Science  3871           5

In [48]:
df.info

<bound method DataFrame.info of       Name  RollNo  Subject  Fees  Extra_fees
0     Diya    3039    Maths  1200          29
1    Navya    3147  English   496          75
2  Geetika    3045  Science  3871           5>

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   RollNo      3 non-null      int64
 2   Subject     3 non-null      object
 3   Fees        3 non-null      int64
 4   Extra_fees  3 non-null      int64
dtypes: int64(3), object(2)
memory usage: 252.0+ bytes

In [50]:
df.describe()

            RollNo         Fees  Extra_fees
count     3.000000     3.000000    3.000000
mean   3077.000000  1855.666667   36.333333
std      60.695964  1780.471941   35.571524
min    3039.000000   496.000000    5.000000
25%    3042.000000   848.000000   17.000000
50%    3045.000000  1200.000000   29.000000
75%    3096.000000  2535.500000   52.000000
max    3147.000000  3871.000000   75.000000

In [51]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
RollNo,3.0,3077.000000,60.695964,3039.0,3042.0,3045.0,3096.0,3147.0
Fees,3.0,1855.666667,1780.471941,496.0,848.0,1200.0,2535.5,3871.0
Extra_fees,3.0,36.333333,35.571524,5.0,17.0,29.0,52.0,75.0

In [52]:
df.head()

      Name  RollNo  Subject  Fees  Extra_fees
0     Diya    3039    Maths  1200          29
1    Navya    3147  English   496          75
2  Geetika    3045  Science  3871           5

In [53]:
df['RollNo']

0    3039
1    3147
2    3045
Name: RollNo, dtype: int64

In [54]:
type(df['RollNo'])

pandas.core.series.Series

In [55]:
mycols = ['RollNo', 'Name']
df[mycols]

   RollNo     Name
0    3039     Diya
1    3147    Navya
2    3045  Geetika

In [57]:
df.head()

      Name  RollNo  Subject  Fees  Extra_fees
0     Diya    3039    Maths  1200          29
1    Navya    3147  English   496          75
2  Geetika    3045  Science  3871           5

In [61]:
df['Extra_fees_percentage'] = 100*df['Extra_fees']/df['Fees']

In [62]:
df.head()

      Name  RollNo  Subject  Fees  Extra_fees  Extra_fees_percentage
0     Diya    3039    Maths  1200          29               2.416667
1    Navya    3147  English   496          75              15.120968
2  Geetika    3045  Science  3871           5               0.129166

In [63]:
df['Extra_fees_percentage'] = np.round(100*df['Extra_fees']/df['Fees'])

In [64]:
df.head()

      Name  RollNo  Subject  Fees  Extra_fees  Extra_fees_percentage
0     Diya    3039    Maths  1200          29                    2.0
1    Navya    3147  English   496          75                   15.0
2  Geetika    3045  Science  3871           5                    0.0

In [66]:
df = df.drop('Extra_fees_percentage', axis=1)

In [67]:
df

      Name  RollNo  Subject  Fees  Extra_fees
0     Diya    3039    Maths  1200          29
1    Navya    3147  English   496          75
2  Geetika    3045  Science  3871           5

In [69]:
df.shape

(3, 5)

In [70]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [74]:
df = df.set_index("Name")

In [73]:
df.shape

(3, 5)

In [75]:
df

         RollNo  Subject  Fees  Extra_fees
Name
Diya       3039    Maths  1200          29
Navya      3147  English   496          75
Geetika    3045  Science  3871           5

In [78]:
df = df.reset_index()

In [79]:
df

      Name  RollNo  Subject  Fees  Extra_fees
0     Diya    3039    Maths  1200          29
1    Navya    3147  English   496          75
2  Geetika    3045  Science  3871           5

In [80]:
df = df.set_index("Name")

In [81]:
df

         RollNo  Subject  Fees  Extra_fees
Name
Diya       3039    Maths  1200          29
Navya      3147  English   496          75
Geetika    3045  Science  3871           5

In [82]:
df.iloc[0]  #integer based location

RollNo         3039
Subject       Maths
Fees           1200
Extra_fees       29
Name: Diya, dtype: object

In [83]:
df.loc['Navya']

RollNo           3147
Subject       English
Fees              496
Extra_fees         75
Name: Navya, dtype: object

In [84]:
df.iloc[0:2]

       RollNo  Subject  Fees  Extra_fees
Name
Diya     3039    Maths  1200          29
Navya    3147  English   496          75

In [85]:
df.loc[['Diya', 'Navya']]

       RollNo  Subject  Fees  Extra_fees
Name
Diya     3039    Maths  1200          29
Navya    3147  English   496          75

In [86]:
df.drop('Geetika', axis=0)

       RollNo  Subject  Fees  Extra_fees
Name
Diya     3039    Maths  1200          29
Navya    3147  English   496          75

In [87]:
df

         RollNo  Subject  Fees  Extra_fees
Name
Diya       3039    Maths  1200          29
Navya      3147  English   496          75
Geetika    3045  Science  3871           5

In [88]:
one_row = df.iloc[0]

In [97]:
one_row

RollNo         3039
Subject       Maths
Fees           1200
Extra_fees       29
Name: Diya, dtype: object

In [98]:
df

RollNo         3039
Subject       Maths
Fees           1200
Extra_fees       29
Name: Diya, dtype: object